{
  "work_experience": [
    {
      "title": "IT Administrator & Course Facilitator",
      "company": "BSG and Technologies",
      "period": "Feb 2025 – Present",
      "location": "Johannesburg, South Africa",
      "type": "full-time",
      "responsibilities": [
        "Built and managed SEO-friendly websites and learning platforms for 50+ students and staff using WordPress and custom templates.",
        "Developed site features with HTML, CSS, PHP, and JavaScript, focusing on responsive and easy-to-use designs.",
        "Used SEO tools to improve site speed and search rankings.",
        "Kept plugins, backups, and content up to date across platforms.",
        "Worked with teams to make sure content and design matched best web practices.",
        "Supported cloud web services and email using Linux servers, cPanel, and Google Workspace.",
        "While I have not used Webflow or GSAP yet, my experience with WordPress and web animations means I can learn these tools quickly."
      ]
    },
    {
      "title": "Founder & Freelance IT Support Technician",
      "company": "del IT & Web",
      "period": "April 2022 – Feb 2025",
      "location": "Johannesburg & Durban, South Africa",
      "type": "business",
      "responsibilities": [
        "Designed and managed client websites using WordPress and Elementor, with a focus on SEO and user experience.",
        "Customized themes, installed plugins, and set up hosting (Hostinger, GoDaddy, Webway).",
        "Trained business clients to manage their own content and improve web visibility.",
        "Created web pages and email campaigns for digital marketing.",
        "Edited images and content using GIMP and Photoshop.",
        "Handled Linux server tasks for site deployment.",
        "I am new to Shopify and Liquid, but my experience with WordPress and e-commerce basics will help me learn quickly."
      ]
    },
    {
      "title": "Private Tutor",
      "company": "Self-Employed",
      "period": "February 2016 – March 2022",
      "location": "Johannesburg & Durban, South Africa",
      "type": "part-time",
      "responsibilities": [
        "Tutored over 50 students in Mathematics and Sciences, helping them achieve better results.",
        "Built strong client relationships and improved learning outcomes through simple, clear strategies.",
        "Created learner-focused schedules and tracked progress."
      ]
    },
    {
      "title": "Educator & ICT Lab Assistant",
      "company": "Kwa-Giba High School",
      "period": "April 2009 – December 2012",
      "location": "Hluhluwe, South Africa",
      "type": "full-time",
      "responsibilities": [
        "Supported ICT Department and coordinated lab activities",
        "Installed and maintained lab hardware and software",
        "Ensured secure systems through antivirus deployment, firewall setup, and user access controls",
        "Delivered full-time classroom teaching in Mathematics and Sciences"
      ]
    }
  ]
}